# Pandas Exercise

### Import the python packages

In [1]:
import pandas as pd
import numpy as np

### 1. Import the customer data into python and name the DataFrame as 'cust'.

In [3]:
cust = pd.read_csv('Customers.csv')
# to execute same code, keep the dataset in your current directory

### 2. Understand the data using different functions and attributes like shape, index, columns, dtypes.ndim, info(), get_dtype_counts etc.

In [5]:
# to display the top five row 
cust.head()
#cust[:5]

,Customer_ID,Gender,First_Date,First_region,First_state,First_city,Recent_Date,Last_region,Last_state,Last_city,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed
0,129609144,M,20130130,West,Gujarat,Surat,20130216,West,Gujarat,Surat,2032.0,2,200.0,0.0
1,129627580,M,20130129,North,Delhi,Delhi,20130129,North,Delhi,Delhi,1709.0,1,100.0,0.0
2,130363481,M,20130221,West,Gujarat,Surat,20130221,West,Gujarat,Surat,523.0,1,10.0,0.0
3,49817480,M,20130222,West,Maharashtra,Pimpri-Chinchwad,20130222,West,Maharashtra,Pimpri-Chinchwad,5132.0,1,170.0,0.0
4,126343829,F,20130301,North,Delhi,Delhi,20130301,North,Delhi,Delhi,1008.0,1,60.0,0.0

In [10]:
cust.index
# It shows the informations about how the index are arranged

RangeIndex(start=0, stop=10000, step=1)

In [12]:
# To get the names of all columns in the DataFrame
cust.columns

Index(['Customer_ID', 'Gender', 'First_Date', 'First_region', 'First_state',
       'First_city', 'Recent_Date', 'Last_region', 'Last_state', 'Last_city',
       'Customer_Value', 'Buy_Times', 'Points_Earned', 'Points_Redeemed'],
      dtype='object')

In [14]:
# To get the names of all columns in the DataFrame in the form of list
cust.columns.tolist()

['Customer_ID',
 'Gender',
 'First_Date',
 'First_region',
 'First_state',
 'First_city',
 'Recent_Date',
 'Last_region',
 'Last_state',
 'Last_city',
 'Customer_Value',
 'Buy_Times',
 'Points_Earned',
 'Points_Redeemed']

In [15]:
# To know the datatype of all columns in the DataFrame
cust.dtypes

Customer_ID          int64
Gender              object
First_Date           int64
First_region        object
First_state         object
First_city          object
Recent_Date          int64
Last_region         object
Last_state          object
Last_city           object
Customer_Value     float64
Buy_Times            int64
Points_Earned      float64
Points_Redeemed    float64
dtype: object

In [16]:
cust.ndim

2

In [18]:
# To get the file level information about the dataset
cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
Customer_ID        10000 non-null int64
Gender             9986 non-null object
First_Date         10000 non-null int64
First_region       9979 non-null object
First_state        9983 non-null object
First_city         10000 non-null object
Recent_Date        10000 non-null int64
Last_region        10000 non-null object
Last_state         10000 non-null object
Last_city          10000 non-null object
Customer_Value     9964 non-null float64
Buy_Times          10000 non-null int64
Points_Earned      9979 non-null float64
Points_Redeemed    9988 non-null float64
dtypes: float64(3), int64(4), object(7)
memory usage: 1.1+ MB

In [21]:
# To know the sattistical summary of dataset
cust.describe()
# It gives the information about total number of observation, mean, max, median, standard deviation, percentiles
# Note : it gives the result of only numerical variable columns

,Customer_ID,First_Date,Recent_Date,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed
count,1.000000e+04,1.000000e+04,1.000000e+04,9.964000e+03,10000.000000,9979.000000,9.988000e+03
mean,8.347904e+07,2.012199e+07,2.012537e+07,1.254489e+04,5.477600,529.355747,5.822111e+02
std,4.802529e+07,3.424373e+03,4.744995e+03,6.546771e+04,11.677831,1861.315677,1.521278e+04
min,5.850000e+02,2.012010e+07,2.012010e+07,0.000000e+00,1.000000,0.000000,0.000000e+00
25%,3.617353e+07,2.012023e+07,2.012082e+07,1.484500e+03,1.000000,65.000000,0.000000e+00
50%,1.146933e+08,2.012070e+07,2.012122e+07,3.960001e+03,2.000000,195.000000,0.000000e+00
75%,1.216234e+08,2.012111e+07,2.013030e+07,1.113600e+04,6.000000,535.000000,0.000000e+00
max,1.324735e+08,2.013033e+07,2.013033e+07,5.098715e+06,586.000000,142030.000000,1.387520e+06

In [24]:
# It gives the information about number of columns of which datatype
cust.get_dtype_counts()

float64    3
int64      4
object     7
dtype: int64

In [26]:
# To show the number of observations are presents in particular Attributes/variables/columns
# Indirectly we can observe the missing values 
cust.count()

Customer_ID        10000
Gender              9986
First_Date         10000
First_region        9979
First_state         9983
First_city         10000
Recent_Date        10000
Last_region        10000
Last_state         10000
Last_city          10000
Customer_Value      9964
Buy_Times          10000
Points_Earned       9979
Points_Redeemed     9988
dtype: int64

In [30]:
# To get the number of observation and number of columns
cust.shape

(10000, 14)

In [31]:
# To display the number of rows only
cust.shape[0]

10000

In [32]:
# To show the number of columns/ no. of attributes
cust.shape[1]

14

### 3. What is percentage of missing values for customer Value variable?

In [48]:
# firstly find out the number of rows mussing in 'Customer_value'
cust['Customer_Value'].isnull().sum()
# a= cust['Customer_Value'].isnull().sum()

36

In [52]:
# find the total length of observation
cust.shape[0]
# b= cust.shape[0]

10000

In [53]:
#divide the missing length of 'Customer_Value' by 'Total length of observation'
cust['Customer_Value'].isnull().sum()/cust.shape[0]
# a/b

0.0036

In [54]:
# to display in terms of percentage multiply by 100
cust['Customer_Value'].isnull().sum()/cust.shape[0]*100

0.36

In [56]:
round(((cust['Customer_Value'].isnull().sum()/cust.shape[0])*100),3)

0.36

### 4. Create two subsets with unique and duplicate values.

In [59]:
# To fing the how many duplicate observation in the dataframe
cust.Customer_ID.duplicated().sum()

45

In [65]:
# create a subset of duplicate value
duplicate= cust[cust.Customer_ID.duplicated()]
duplicate.head()

,Customer_ID,Gender,First_Date,First_region,First_state,First_city,Recent_Date,Last_region,Last_state,Last_city,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed
9817,113918804,M,20120226,West,Gujarat,Ahmedabad,20120712,West,Gujarat,Ahmedabad,7048.800,6,282.0,0.0
9818,113933467,F,20120226,South,Tamil Nadu,Chennai,20130312,East,Bihar,Patna,68863.601,19,3374.0,0.0
9819,41337621,F,20120228,West,Gujarat,Surat,20130207,West,Gujarat,Surat,7036.001,6,635.0,0.0
9820,6896372,M,20120228,West,Maharashtra,Nashik,20120228,West,Maharashtra,Nashik,1259.000,1,70.0,0.0
9821,114142599,M,20120303,West,Gujarat,Surat,20130205,West,Gujarat,Surat,19136.096,13,986.0,0.0

In [75]:
# to get the number of rows and columns of duplicate subset
duplicate.shape

(45, 14)

In [73]:
# create a subset of unique values value
unique_values= cust[cust.Customer_ID.duplicated()==False]
unique_values.head()

,Customer_ID,Gender,First_Date,First_region,First_state,First_city,Recent_Date,Last_region,Last_state,Last_city,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed
0,129609144,M,20130130,West,Gujarat,Surat,20130216,West,Gujarat,Surat,2032.0,2,200.0,0.0
1,129627580,M,20130129,North,Delhi,Delhi,20130129,North,Delhi,Delhi,1709.0,1,100.0,0.0
2,130363481,M,20130221,West,Gujarat,Surat,20130221,West,Gujarat,Surat,523.0,1,10.0,0.0
3,49817480,M,20130222,West,Maharashtra,Pimpri-Chinchwad,20130222,West,Maharashtra,Pimpri-Chinchwad,5132.0,1,170.0,0.0
4,126343829,F,20130301,North,Delhi,Delhi,20130301,North,Delhi,Delhi,1008.0,1,60.0,0.0

In [74]:
# to get the number of rows and columns of unique subset
unique_values.shape

(9955, 14)

### 5. Create data set with list of customers whose customer value greater than 10000.

In [84]:
cust_10000= cust[cust['Customer_Value']> 10000]
cust_10000.shape[0]

2723

In [89]:
# Reset the index values and drops the original index number
cust_10000= cust[cust['Customer_Value']> 10000].reset_index(drop= True)

In [90]:
cust_10000.head()

,Customer_ID,Gender,First_Date,First_region,First_state,First_city,Recent_Date,Last_region,Last_state,Last_city,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed
0,1610085,F,20120103,North,Delhi,Delhi,20121013,North,Delhi,Delhi,10380.199,6,1189.0,0.0
1,7518872,M,20120104,North,Uttar Pradesh,Kanpur,20130123,North,Uttar Pradesh,Kanpur,14587.000,6,865.0,0.0
2,63508964,M,20120106,West,Maharashtra,Pimpri-Chinchwad,20130222,West,Maharashtra,Pimpri-Chinchwad,145472.702,36,680.0,16635.0
3,23667984,F,20120107,West,Maharashtra,Nagpur,20130313,West,Maharashtra,Nagpur,19640.700,12,268.0,2549.0
4,84634600,M,20120108,South,Karnataka,Bangalore,20130307,South,Karnataka,Bangalore,32377.602,22,1029.0,1771.0

### 6. In customer table, create a new variable called “customer value segment” using customer value as follows. -
 ### High Segment - > 25000
 ### Medium Segment – Between 10000 and 25000
 ### Low Segment – less than or equal to 10000

In [110]:
from numpy import where as IF
#customer_value = CV
CV= cust.Customer_Value
cust['Customer_value_segment']= IF(CV > 25000, 'HIgh Srgment', IF((CV > 10000) & (CV < 25000), 'Medium Segment','Low Segment'))

In [111]:
cust.head()

,Customer_ID,Gender,First_Date,First_region,First_state,First_city,Recent_Date,Last_region,Last_state,Last_city,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed,Customer_value_segment
0,129609144,M,20130130,West,Gujarat,Surat,20130216,West,Gujarat,Surat,2032.0,2,200.0,0.0,Low Segment
1,129627580,M,20130129,North,Delhi,Delhi,20130129,North,Delhi,Delhi,1709.0,1,100.0,0.0,Low Segment
2,130363481,M,20130221,West,Gujarat,Surat,20130221,West,Gujarat,Surat,523.0,1,10.0,0.0,Low Segment
3,49817480,M,20130222,West,Maharashtra,Pimpri-Chinchwad,20130222,West,Maharashtra,Pimpri-Chinchwad,5132.0,1,170.0,0.0,Low Segment
4,126343829,F,20130301,North,Delhi,Delhi,20130301,North,Delhi,Delhi,1008.0,1,60.0,0.0,Low Segment

### 7. Create variables “average revenue per trip” and “balance points” in the customer data set.

In [114]:
cust = cust.assign(average_revenue_per_trip= cust.Customer_Value/cust.Buy_Times,
                  Balance_Points=cust.Points_Earned - cust.Points_Redeemed )

In [115]:
cust.head()

,Customer_ID,Gender,First_Date,First_region,First_state,First_city,Recent_Date,Last_region,Last_state,Last_city,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed,Customer_value_segment,average_revenue_per_trip,Balance_Points
0,129609144,M,20130130,West,Gujarat,Surat,20130216,West,Gujarat,Surat,2032.0,2,200.0,0.0,Low Segment,1016.0,200.0
1,129627580,M,20130129,North,Delhi,Delhi,20130129,North,Delhi,Delhi,1709.0,1,100.0,0.0,Low Segment,1709.0,100.0
2,130363481,M,20130221,West,Gujarat,Surat,20130221,West,Gujarat,Surat,523.0,1,10.0,0.0,Low Segment,523.0,10.0
3,49817480,M,20130222,West,Maharashtra,Pimpri-Chinchwad,20130222,West,Maharashtra,Pimpri-Chinchwad,5132.0,1,170.0,0.0,Low Segment,5132.0,170.0
4,126343829,F,20130301,North,Delhi,Delhi,20130301,North,Delhi,Delhi,1008.0,1,60.0,0.0,Low Segment,1008.0,60.0

### 8. How many days between last purchase date and today?

In [118]:
import datetime as dt
today = pd.to_datetime(dt.datetime.now().date())
day_difference = today - pd.to_datetime(cust.Recent_Date,format= '%Y%m%d')
day_difference

0      2203 days
1      2221 days
2      2198 days
3      2197 days
4      2190 days
5      2177 days
6      2173 days
7      2170 days
8      2160 days
9      2166 days
10     2615 days
11     2300 days
12     2177 days
13     2285 days
14     2329 days
15     2227 days
16     2613 days
17     2207 days
18     2197 days
19     2178 days
20     2184 days
21     2252 days
22     2605 days
23     2271 days
24     2189 days
25     2605 days
26     2441 days
27     2232 days
28     2197 days
29     2242 days
          ...
9970   2161 days
9971   2197 days
9972   2328 days
9973   2197 days
9974   2172 days
9975   2471 days
9976   2236 days
9977   2595 days
9978   2589 days
9979   2284 days
9980   2179 days
9981   2585 days
9982   2178 days
9983   2181 days
9984   2181 days
9985   2270 days
9986   2584 days
9987   2163 days
9988   2584 days
9989   2584 days
9990   2582 days
9991   2472 days
9992   2487 days
9993   2580 days
9994   2201 days
9995   2297 days
9996   2172 days
9997   2203 days
9998   2570 days
9999   2568 days
Name: Recent_Date, Length: 10000, dtype: timedelta64[ns]

### 9. Calculate percentage of sales by each last city, state and region.

In [119]:
# Select only 'last_region', 'last_state', 'last_city' and 'Customer_Value' columns
demography= cust[['Last_region', 'Last_state', 'Last_city', 'Customer_Value']]

In [120]:
demography.head()

  Last_region   Last_state         Last_city  Customer_Value
0        West      Gujarat             Surat          2032.0
1       North        Delhi             Delhi          1709.0
2        West      Gujarat             Surat           523.0
3        West  Maharashtra  Pimpri-Chinchwad          5132.0
4       North        Delhi             Delhi          1008.0

In [123]:
demography.groupby(['Last_region'])['Customer_Value'].sum()/demography.Customer_Value.sum()

Last_region
East     0.077987
North    0.277416
South    0.154038
West     0.490560
Name: Customer_Value, dtype: float64

In [122]:
demography.groupby(['Last_region', 'Last_state'])['Customer_Value'].sum()/demography.Customer_Value.sum()

Last_region  Last_state
East         Assam                0.015573
             Bihar                0.002606
             Jharkhand            0.002456
             Tripura              0.000188
             West Bengal          0.057162
North        Chandigarh           0.000328
             Chhattisgarh         0.000053
             Delhi                0.085912
             Haryana              0.001415
             Jammu and Kashmir    0.000049
             Madhya Pradesh       0.053475
             Orissa               0.001566
             Punjab               0.000088
             Rajasthan            0.031332
             Uttar Pradesh        0.102959
             Uttarakhand          0.000238
South        Andhra Pradesh       0.014727
             Karnataka            0.053301
             Kerala               0.001009
             Puducherry           0.000224
             Tamil Nadu           0.046566
             Telangana            0.038211
West         Gujarat              0.375800
             Maharashtra          0.114760
Name: Customer_Value, dtype: float64

In [121]:
demography.groupby(['Last_region', 'Last_state', 'Last_city'])['Customer_Value'].sum()/demography.Customer_Value.sum()

Last_region  Last_state         Last_city
East         Assam              Guwahati            0.015573
             Bihar              Begusarai           0.000206
                                Bhagalpur           0.000022
                                Katihar             0.000469
                                Patna               0.001851
                                Purnia              0.000059
             Jharkhand          Dhanbad             0.001975
                                Jamshedpur          0.000028
                                Ranchi              0.000453
             Tripura            Agartala            0.000188
             West Bengal        Asansol             0.000030
                                Baranagar           0.000160
                                Barasat             0.000040
                                Bhatpara            0.000635
                                Howrah              0.000178
                                Kolkata             0.055734
                                North Dumdum        0.000228
                                Panihati            0.000055
                                Rajpur Sonarpur     0.000017
                                Siliguri            0.000083
North        Chandigarh         Chandigarh          0.000328
             Chhattisgarh       Korba               0.000022
                                Raipur              0.000031
             Delhi              Delhi               0.085813
                                Karawal Nagar       0.000078
                                New Delhi           0.000021
             Haryana            Gurgaon             0.001263
                                Karnal              0.000021
                                Sonipat             0.000131
             Jammu and Kashmir  Srinagar            0.000049
                                                      ...
South        Tamil Nadu         Chennai             0.044012
                                Madurai             0.001097
                                Nagercoil           0.000051
                                Salem               0.000248
                                Thoothukudi         0.000419
                                Tirunelveli         0.000068
                                Tiruvottiyur        0.000119
             Telangana          Hyderabad           0.038068
                                Karimnagar          0.000055
                                Khammam             0.000008
                                Warangal            0.000080
West         Gujarat            Ahmedabad           0.060634
                                Gandhidham          0.000017
                                Jamnagar            0.000708
                                Rajkot              0.036418
                                Surat               0.248166
                                Vadodara            0.029857
             Maharashtra        Ambernath           0.000039
                                Aurangabad          0.000772
                                Bhiwandi            0.000031
                                Ichalkaranji        0.000286
                                Mira-Bhayandar      0.001903
                                Mumbai              0.050909
                                Nagpur              0.016909
                                Nashik              0.007371
                                Navi Mumbai         0.000106
                                Pimpri-Chinchwad    0.033146
                                Thane               0.002372
                                Ulhasnagar          0.000057
                                Vasai-Virar         0.000860
Name: Customer_Value, Length: 116, dtype: float64

### 10. What is the count of customers, average number of purchases and average purchase transaction value by last state and city.

In [127]:
cust.groupby(['Last_state', 'Last_city'])['Customer_ID'].count()

Last_state         Last_city
Andhra Pradesh     Guntur                1
                   Kurnool               1
                   Tirupati              2
                   Vijayawada           20
                   Visakhapatnam       117
                   Vizianagaram          1
Assam              Guwahati             30
Bihar              Begusarai             1
                   Bhagalpur             1
                   Katihar               2
                   Patna                20
                   Purnia                1
Chandigarh         Chandigarh            6
Chhattisgarh       Korba                 1
                   Raipur                1
Delhi              Delhi              1034
                   Karawal Nagar         2
                   New Delhi             1
Gujarat            Ahmedabad           621
                   Gandhidham            1
                   Jamnagar              6
                   Rajkot              235
                   Surat              2127
                   Vadodara            388
Haryana            Gurgaon               1
                   Karnal                1
                   Sonipat               1
Jammu and Kashmir  Srinagar              1
Jharkhand          Dhanbad              18
                   Jamshedpur            1
                                      ...
Uttar Pradesh      Aligarh               9
                   Allahabad             2
                   Bareilly              3
                   Etawah                1
                   Firozabad             4
                   Ghaziabad            27
                   Gorakhpur             4
                   Kanpur              854
                   Loni                 10
                   Lucknow             219
                   Mathura               6
                   Mau                   1
                   Meerut                7
                   Mirzapur              1
                   Muzaffarnagar         2
                   Noida                 1
                   Rampur                1
                   Saharanpur            2
Uttarakhand        Dehradun              1
                   Haridwar              1
West Bengal        Asansol               1
                   Baranagar             2
                   Barasat               1
                   Bhatpara              4
                   Howrah                3
                   Kolkata             543
                   North Dumdum          3
                   Panihati              1
                   Rajpur Sonarpur       2
                   Siliguri              1
Name: Customer_ID, Length: 116, dtype: int64

In [128]:
cust.groupby(['Last_state', 'Last_city'])['Buy_Times'].count()

Last_state         Last_city
Andhra Pradesh     Guntur                1
                   Kurnool               1
                   Tirupati              2
                   Vijayawada           20
                   Visakhapatnam       117
                   Vizianagaram          1
Assam              Guwahati             30
Bihar              Begusarai             1
                   Bhagalpur             1
                   Katihar               2
                   Patna                20
                   Purnia                1
Chandigarh         Chandigarh            6
Chhattisgarh       Korba                 1
                   Raipur                1
Delhi              Delhi              1034
                   Karawal Nagar         2
                   New Delhi             1
Gujarat            Ahmedabad           621
                   Gandhidham            1
                   Jamnagar              6
                   Rajkot              235
                   Surat              2127
                   Vadodara            388
Haryana            Gurgaon               1
                   Karnal                1
                   Sonipat               1
Jammu and Kashmir  Srinagar              1
Jharkhand          Dhanbad              18
                   Jamshedpur            1
                                      ...
Uttar Pradesh      Aligarh               9
                   Allahabad             2
                   Bareilly              3
                   Etawah                1
                   Firozabad             4
                   Ghaziabad            27
                   Gorakhpur             4
                   Kanpur              854
                   Loni                 10
                   Lucknow             219
                   Mathura               6
                   Mau                   1
                   Meerut                7
                   Mirzapur              1
                   Muzaffarnagar         2
                   Noida                 1
                   Rampur                1
                   Saharanpur            2
Uttarakhand        Dehradun              1
                   Haridwar              1
West Bengal        Asansol               1
                   Baranagar             2
                   Barasat               1
                   Bhatpara              4
                   Howrah                3
                   Kolkata             543
                   North Dumdum          3
                   Panihati              1
                   Rajpur Sonarpur       2
                   Siliguri              1
Name: Buy_Times, Length: 116, dtype: int64

In [129]:
cust.groupby(['Last_state', 'Last_city'])['average_revenue_per_trip'].mean()

Last_state         Last_city
Andhra Pradesh     Guntur                0.000000
                   Kurnool             778.374750
                   Tirupati           1828.333333
                   Vijayawada         1981.191171
                   Visakhapatnam      2383.914601
                   Vizianagaram       1920.216667
Assam              Guwahati           1454.017522
Bihar              Begusarai          2855.333222
                   Bhagalpur           929.266333
                   Katihar            1847.899976
                   Patna              1475.133293
                   Purnia             1833.500000
Chandigarh         Chandigarh         2014.771241
Chhattisgarh       Korba               928.800000
                   Raipur             1288.666667
Delhi              Delhi              2125.372904
                   Karawal Nagar      1189.716667
                   New Delhi           886.666667
Gujarat            Ahmedabad          2028.178722
                   Gandhidham         1044.500000
                   Jamnagar           1368.168311
                   Rajkot             2342.410772
                   Surat              2603.479511
                   Vadodara           2504.125659
Haryana            Gurgaon            2505.119048
                   Karnal             1336.000000
                   Sonipat            1259.615385
Jammu and Kashmir  Srinagar           1524.750000
Jharkhand          Dhanbad            2240.077755
                   Jamshedpur         1779.999500
                                         ...
Uttar Pradesh      Aligarh             889.811111
                   Allahabad           803.295833
                   Bareilly           3138.317460
                   Etawah             1201.333333
                   Firozabad          2157.012104
                   Ghaziabad          1275.472336
                   Gorakhpur          1791.954083
                   Kanpur             2481.439472
                   Loni               1177.249825
                   Lucknow            1998.408521
                   Mathura            1923.992922
                   Mau                1793.550000
                   Meerut             1234.443913
                   Mirzapur           1627.000000
                   Muzaffarnagar      1187.350000
                   Noida              1371.433333
                   Rampur             2480.949250
                   Saharanpur         4011.029412
Uttarakhand        Dehradun            767.500500
                   Haridwar           4711.933333
West Bengal        Asansol            1264.666667
                   Baranagar          2363.340000
                   Barasat            2517.447520
                   Bhatpara           2025.656855
                   Howrah             1543.494444
                   Kolkata            2107.631101
                   North Dumdum       3307.377778
                   Panihati            989.000429
                   Rajpur Sonarpur     541.500000
                   Siliguri           2594.750000
Name: average_revenue_per_trip, Length: 116, dtype: float64